#include<stdio.h>
void main()
{
	int a[2][3]={1,2,3,4,5,6};
	int *p1,(*p2)[3];           /*p1指向数组元素，p2指向包含3个元素的一维数组*/
	p1=a[0];    /*等价于p1=a[0][0],p1++则是指向a[0][1]*/
	for(;p1<a[0]+6;p1++)
		printf("%4d",*p1);
	printf("\n");   
	/*用指向一维数组的指针变量输出二维数组元素*/
	p2=a;  /*p2指向含3个元素的一维数组，而p2++则是指向下一行一维数组a[1]*/
	for(;p2<a+2;p2++)
	printf("%4d",*(*p2));
	printf("\n");
}
/*二维数组a[m][n]的元素a[i][j]的地址，用指向包含n个元素的一维数组的
指针变量p表示形式为：*(p+i)+j,即*(*(p+i)+j)的值。另外注意区分int (*q)[3]和int *p[3];
q是指向包含3个整型元素的一维数组的指针变量，p是由p[0],p[1],p[2]共同指向整型数据的指针组成的一维数组*/
